README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-26 Fri 15:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>org-pages 项目说明</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="css/worg.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a>
</div>
<div id="content">
<h1 class="title">org-pages 项目说明</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd45344b">org-pages</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd45344b" class="outline-2">
<h2 id="orgd45344b">org-pages</h2>
<div class="outline-text-2" id="text-orgd45344b">
<ul class="org-ul">
<li><p>
<a href="https://github.com/Nanue1/org-pages">emacs文档备份路径</a>
</p>

<p>
备份一些平时，脑子记不住的内容
</p></li>

<li><p>
org转html 快捷键
</p>

<p>
M-x org-publish-project
</p></li>

<li><p>
emacs 自动生成html文件配置
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #C4BE89;">(</span>setq org-publish-project-alist
'<span style="color: #FD971F;">(</span>

<span style="color: #EF5939;">(</span><span style="color: #E6DB74;">"org-html"</span>
<span style="color: #A6E22E;">:base-directory</span> <span style="color: #E6DB74;">"~/github/org-pages"</span>
<span style="color: #A6E22E;">:base-extension</span> <span style="color: #E6DB74;">"org"</span>
<span style="color: #A6E22E;">:publishing-directory</span> <span style="color: #E6DB74;">"~/github/html-pages"</span>
<span style="color: #A6E22E;">:section-numbers</span> nil
<span style="color: #A6E22E;">:recursive</span> t
<span style="color: #A6E22E;">:publishing-function</span> org-html-publish-to-html
<span style="color: #A6E22E;">:headline-levels</span> 4
<span style="color: #A6E22E;">:auto-sitemap</span> t
<span style="color: #A6E22E;">:sitemap-filename</span> <span style="color: #E6DB74;">"sitemap.org"</span>
<span style="color: #A6E22E;">:sitemap-title</span> <span style="color: #E6DB74;">"Sitemap"</span>
<span style="color: #A6E22E;">:auto-preamble</span> t
<span style="color: #A6E22E;">:author</span> nil
<span style="color: #A6E22E;">:creator-info</span> nil
<span style="color: #A6E22E;">:auto-postamble</span> nil<span style="color: #EF5939;">)</span>
<span style="color: #EF5939;">(</span><span style="color: #E6DB74;">"org-static"</span>
<span style="color: #A6E22E;">:base-directory</span> <span style="color: #E6DB74;">"~/github/org-pages"</span>
<span style="color: #A6E22E;">:base-extension</span> <span style="color: #E6DB74;">"html\\|css\\|js\\|ico\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf\\|java\\|py\\|zip\\|arff\\|dat\\|cpp\\|xls\\|otf\\|woff"</span>
<span style="color: #A6E22E;">:publishing-directory</span> <span style="color: #E6DB74;">"~/github/html-pages"</span>
<span style="color: #A6E22E;">:recursive</span> t
<span style="color: #A6E22E;">:publishing-function</span> org-publish-attachment<span style="color: #EF5939;">)</span>
<span style="color: #EF5939;">(</span><span style="color: #E6DB74;">"org-pages"</span> <span style="color: #A6E22E;">:components</span> <span style="color: #F92672;">(</span><span style="color: #E6DB74;">"org-html"</span> <span style="color: #E6DB74;">"org-static"</span><span style="color: #F92672;">)</span><span style="color: #EF5939;">)</span>
<span style="color: #FD971F;">)</span><span style="color: #C4BE89;">)</span>

<span style="color: #C4BE89;">(</span>setq org-export-copy-to-kill-ring nil<span style="color: #C4BE89;">)</span>
<span style="color: #C4BE89;">(</span>setq org-export-with-sub-superscripts nil<span style="color: #C4BE89;">)</span>

<span style="color: #C4BE89;">(</span>setq org-html-postamble nil<span style="color: #C4BE89;">)</span>
<span style="color: #C4BE89;">(</span>setq org-html-preamble <span style="color: #E6DB74;">"&lt;a href=\"index.html\"&gt;Home&lt;/a&gt;"</span><span style="color: #C4BE89;">)</span>

<span style="color: #465457; font-style: italic;">;; </span><span style="color: #465457; font-style: italic;">&#31561;&#23485;: Source Code Pro 13 + STkaiti 16</span>
<span style="color: #C4BE89;">(</span>setq face-font-rescale-alist `<span style="color: #FD971F;">(</span><span style="color: #EF5939;">(</span><span style="color: #E6DB74;">"STkaiti"</span> . ,<span style="color: #F92672;">(</span>/ 16.0 13<span style="color: #F92672;">)</span><span style="color: #EF5939;">)</span><span style="color: #FD971F;">)</span><span style="color: #C4BE89;">)</span>

<span style="color: #C4BE89;">(</span>set-face-attribute 'default nil <span style="color: #A6E22E;">:font</span> <span style="color: #E6DB74;">"Source Code Pro-13"</span><span style="color: #C4BE89;">)</span>

<span style="color: #C4BE89;">(</span>set-fontset-font t 'han      <span style="color: #FD971F;">(</span>font-spec <span style="color: #A6E22E;">:family</span> <span style="color: #E6DB74;">"STkaiti"</span><span style="color: #FD971F;">)</span><span style="color: #C4BE89;">)</span>
<span style="color: #C4BE89;">(</span>set-fontset-font t 'cjk-misc <span style="color: #FD971F;">(</span>font-spec <span style="color: #A6E22E;">:family</span> <span style="color: #E6DB74;">"STkaiti"</span><span style="color: #FD971F;">)</span><span style="color: #C4BE89;">)</span>

</pre>
</div></li>
</ul>
</div>
</div>
</div>
</body>
</html>